## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # kubernetes_manifest.argocd_virtualservice will be created
+   resource "kubernetes_manifest" "argocd_virtualservice" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "argocd"
+               namespace = "argocd"
            }
+           spec       = {
+               gateways = [
+                   "argocd",
                ]
+               hosts    = [
+                   "argocd.wayofthesys.org",
                ]
+               http     = [
+                   {
+                       match = [
+                           {
+                               uri = {
+                                   prefix = "/"
                                }
                            },
                        ]
+                       route = [
+                           {
+                               destination = {
+                                   host = "argocd-server"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd"
+               namespace                  = "argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "argocd",
                ]
+               hosts    = [
+                   "argocd.wayofthesys.org",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       directResponse   = {
+                           body   = {
+                               bytes  = (known after apply)
+                               string = (known after apply)
                            }
+                           status = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = [
+                           {
+                               authority       = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               gateways        = (known after apply)
+                               headers         = (known after apply)
+                               ignoreUriCase   = (known after apply)
+                               method          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               name            = (known after apply)
+                               port            = (known after apply)
+                               queryParams     = (known after apply)
+                               scheme          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               sourceLabels    = (known after apply)
+                               sourceNamespace = (known after apply)
+                               statPrefix      = (known after apply)
+                               uri             = {
+                                   exact  = (known after apply)
+                                   prefix = "/"
+                                   regex  = (known after apply)
                                }
+                               withoutHeaders  = (known after apply)
                            },
                        ]
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "argocd-server"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

  # kubernetes_manifest.cinema-gateway will be created
+   resource "kubernetes_manifest" "cinema-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "cinema"
+               namespace = "cinema"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = false
                        }
                    },
+                   {
+                       hosts = [
+                           "wayofthesys.org",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName    = "wayofthesys-org-tls"
+                           mode              = "SIMPLE"
+                           privateKey        = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate = "/etc/istio/ingressgateway-certs/tls.crt"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.org",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "wayofthesys-org-tls"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate     = "/etc/istio/ingressgateway-certs/tls.crt"
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # kubernetes_manifest.cinema_virtualservice will be created
+   resource "kubernetes_manifest" "cinema_virtualservice" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "cinema"
+               namespace = "cinema"
            }
+           spec       = {
+               gateways = [
+                   "argocd",
                ]
+               hosts    = [
+                   "wayofthesys.org",
                ]
+               http     = [
+                   {
+                       match = [
+                           {
+                               uri = {
+                                   prefix = "/"
                                }
                            },
                        ]
+                       route = [
+                           {
+                               destination = {
+                                   host = "cinema-website"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "argocd",
                ]
+               hosts    = [
+                   "wayofthesys.org",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       directResponse   = {
+                           body   = {
+                               bytes  = (known after apply)
+                               string = (known after apply)
                            }
+                           status = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = [
+                           {
+                               authority       = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               gateways        = (known after apply)
+                               headers         = (known after apply)
+                               ignoreUriCase   = (known after apply)
+                               method          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               name            = (known after apply)
+                               port            = (known after apply)
+                               queryParams     = (known after apply)
+                               scheme          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               sourceLabels    = (known after apply)
+                               sourceNamespace = (known after apply)
+                               statPrefix      = (known after apply)
+                               uri             = {
+                                   exact  = (known after apply)
+                                   prefix = "/"
+                                   regex  = (known after apply)
                                }
+                               withoutHeaders  = (known after apply)
                            },
                        ]
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "cinema-website"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

  # kubernetes_manifest.virtualservice_resource will be destroyed
  # (because kubernetes_manifest.virtualservice_resource is not in configuration)
-   resource "kubernetes_manifest" "virtualservice_resource" {
-       manifest = {
-           apiVersion = "networking.istio.io/v1beta1"
-           kind       = "VirtualService"
-           metadata   = {
-               name      = "argocd"
-               namespace = "argocd"
            }
-           spec       = {
-               gateways = [
-                   "argocd",
                ]
-               hosts    = [
-                   "argocd.wayofthesys.org",
                ]
-               http     = [
-                   {
-                       match = [
-                           {
-                               uri = {
-                                   prefix = "/"
                                }
                            },
                        ]
-                       route = [
-                           {
-                               destination = {
-                                   host = "argocd-server"
-                                   port = {
-                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        } -> null
-       object   = {
-           apiVersion = "networking.istio.io/v1beta1"
-           kind       = "VirtualService"
-           metadata   = {
-               annotations                = null
-               clusterName                = null
-               creationTimestamp          = null
-               deletionGracePeriodSeconds = null
-               deletionTimestamp          = null
-               finalizers                 = null
-               generateName               = null
-               generation                 = null
-               labels                     = null
-               managedFields              = null
-               name                       = "argocd"
-               namespace                  = "argocd"
-               ownerReferences            = null
-               resourceVersion            = null
-               selfLink                   = null
-               uid                        = null
            }
-           spec       = {
-               exportTo = null
-               gateways = [
-                   "argocd",
                ]
-               hosts    = [
-                   "argocd.wayofthesys.org",
                ]
-               http     = [
-                   {
-                       corsPolicy       = {
-                           allowCredentials = null
-                           allowHeaders     = null
-                           allowMethods     = null
-                           allowOrigin      = null
-                           allowOrigins     = null
-                           exposeHeaders    = null
-                           maxAge           = null
                        }
-                       delegate         = {
-                           name      = null
-                           namespace = null
                        }
-                       directResponse   = {
-                           body   = {
-                               bytes  = null
-                               string = null
                            }
-                           status = null
                        }
-                       fault            = {
-                           abort = {
-                               grpcStatus = null
-                               http2Error = null
-                               httpStatus = null
-                               percentage = {
-                                   value = null
                                }
                            }
-                           delay = {
-                               exponentialDelay = null
-                               fixedDelay       = null
-                               percent          = null
-                               percentage       = {
-                                   value = null
                                }
                            }
                        }
-                       headers          = {
-                           request  = {
-                               add    = null
-                               remove = null
-                               set    = null
                            }
-                           response = {
-                               add    = null
-                               remove = null
-                               set    = null
                            }
                        }
-                       match            = [
-                           {
-                               authority       = {
-                                   exact  = null
-                                   prefix = null
-                                   regex  = null
                                }
-                               gateways        = null
-                               headers         = null
-                               ignoreUriCase   = null
-                               method          = {
-                                   exact  = null
-                                   prefix = null
-                                   regex  = null
                                }
-                               name            = null
-                               port            = null
-                               queryParams     = null
-                               scheme          = {
-                                   exact  = null
-                                   prefix = null
-                                   regex  = null
                                }
-                               sourceLabels    = null
-                               sourceNamespace = null
-                               statPrefix      = null
-                               uri             = {
-                                   exact  = null
-                                   prefix = "/"
-                                   regex  = null
                                }
-                               withoutHeaders  = null
                            },
                        ]
-                       mirror           = {
-                           host   = null
-                           port   = {
-                               number = null
                            }
-                           subset = null
                        }
-                       mirrorPercent    = null
-                       mirrorPercentage = {
-                           value = null
                        }
-                       mirror_percent   = null
-                       name             = null
-                       redirect         = {
-                           authority    = null
-                           derivePort   = null
-                           port         = null
-                           redirectCode = null
-                           scheme       = null
-                           uri          = null
                        }
-                       retries          = {
-                           attempts              = null
-                           perTryTimeout         = null
-                           retryOn               = null
-                           retryRemoteLocalities = null
                        }
-                       rewrite          = {
-                           authority = null
-                           uri       = null
                        }
-                       route            = [
-                           {
-                               destination = {
-                                   host   = "argocd-server"
-                                   port   = {
-                                       number = 80
                                    }
-                                   subset = null
                                }
-                               headers     = {
-                                   request  = {
-                                       add    = null
-                                       remove = null
-                                       set    = null
                                    }
-                                   response = {
-                                       add    = null
-                                       remove = null
-                                       set    = null
                                    }
                                }
-                               weight      = null
                            },
                        ]
-                       timeout          = null
                    },
                ]
-               tcp      = null
-               tls      = null
            }
        } -> null
    }

Plan: 3 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
